Tekla.Structures.DialogInternal.dotdiaAttributeDefinition_t
Attribute definition.

Tekla.Structures.DialogInternal.dotdiaAttributeDefinition_t.dialogName
The name of the dialog.

Tekla.Structures.DialogInternal.dotdiaAttributeDefinition_t.name
The name of the attribute.

Tekla.Structures.DialogInternal.dotdiaAttributeDefinition_t.toggleName
The toggle name of the attribute.

Tekla.Structures.DialogInternal.dotdiaAttributeDefinition_t.valueType
The type of the value.

Tekla.Structures.DialogInternal.dotdiaAttributeDefinition_t.fieldType
The type of the field.